Tekla.Structures.CatalogInternal.dotExtrema_t
Serialization structure for shape extrema.

Tekla.Structures.CatalogInternal.dotExtrema_t.aMinPoint
The extrema minimum.

Tekla.Structures.CatalogInternal.dotExtrema_t.aMaxPoint
The extrema maximum.

Tekla.Structures.CatalogInternal.dotExtrema_t.ToStruct(Tekla.Structures.Geometry3d.AABB)
Converts an open API bounding box to an extrema structure.
boundingBox:

Tekla.Structures.CatalogInternal.dotExtrema_t.FromStruct(Tekla.Structures.Geometry3d.AABB)
Converts an extrema structure to an open API bounding.
boundingBox: